Revit 2027 API
BuiltInFailures.AnalyticalModelFailures.AnalyticalPanelNotVisible Property
 Analytical Panel is not visible in the current view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId AnalyticalPanelNotVisible { get; }
Public Shared ReadOnly Property AnalyticalPanelNotVisible As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ AnalyticalPanelNotVisible {
	FailureDefinitionId^ get ();
}
static member AnalyticalPanelNotVisible : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace